import React, { Component } from "react";
import { Responsive, Container, Menu, List, Divider } from "semantic-ui-react";
import Footer from "../Footer";
import NavMenu from "../NavMenu";

class Support extends Component {
  constructor() {
    super();
    this.state = {
      activeItem: "faq",
      errors: {},
    };
  }

  componentWillMount() {
    document.title = "Paku - Support";
  }

  handleItemClick = (e, { name }) => this.setState({ activeItem: name });

  showFaqDetail = () => {
    return (
      <List as="ul">
        <List.Item>
          <List.Icon name="help" />
          <List.Content>
            <List.Header>
              <div>ใครเป็นเจ้าของที่จอดรถ PAKU ได้บ้าง</div>
            </List.Header>
          </List.Content>
        </List.Item>
        <List.Item className="mb-4">
          <List.Icon name="comments" />
          <List.Content>
            <List.Description
              style={{
                "line-height": "normal",
              }}
            >
              การเป็นเจ้าของที่จอดรถ PAKU ทำได้ง่าย ๆ
              และยังสร้างประกาศที่จอดรถได้ฟรีด้วย
              หากต้องการทราบรายละเอียดเกี่ยวกับความคาดหวังที่มีต่อเจ้าของที่จอดรถ
              โปรดอ่านข้อมูลเกี่ยวกับมาตรฐานการรักษาความปลอดภัย ความน่าเชื่อถือ
              และการให้บริการต้อนรับ
              เพื่อช่วยให้เจ้าของที่จอดรถได้รับคะแนนรีวิวดี ๆ
            </List.Description>
          </List.Content>
        </List.Item>

        <List.Item>
          <List.Icon name="help" />
          <List.Content>
            <List.Header>
              <div>ผู้เข้าพักต้องทำอะไรบ้างก่อนจองที่จอดรถ</div>
            </List.Header>
          </List.Content>
        </List.Item>
        <List.Item className="mb-4">
          <List.Icon name="comments" />
          <List.Content>
            <List.Description
              style={{
                "line-height": "normal",
              }}
            >
              เราขอให้ผู้ใช้ PAKU ทุกคนกรอกข้อมูลเล็กน้อยก่อนใช้บริการกับเรา
              ผู้เช่าที่จอดรถ ต้องกรอกข้อมูลนี้ให้ครบถ้วนก่อน จึงจะส่งคำขอจองได้
              <List.Item>
                ข้อกำหนดของ PAKU สำหรับผู้เช่าที่จอดรถ ได้แก่
                <List.List as="ul">
                  <List.Item as="li">ชื่อ - นามสกุล</List.Item>
                  <List.Item as="li">อีเมล</List.Item>
                  <List.Item as="li">เบอร์โทรที่ยืนยันแล้ว</List.Item>
                  <List.Item as="li">
                    บัตรประจำตัว เช่น บัตรประชาชน ใบขับขี่ หนังสือเดินทาง
                  </List.Item>
                  <List.Item as="li">คำยินยอมที่จะทำตามกฎของที่จอดรถ</List.Item>
                </List.List>
              </List.Item>
            </List.Description>
          </List.Content>
        </List.Item>

        <List.Item>
          <List.Icon name="help" />
          <List.Content>
            <List.Header>
              <div>การลงประกาศที่จอดรถมีค่าใช้จ่ายเท่าไร</div>
            </List.Header>
          </List.Content>
        </List.Item>
        <List.Item className="mb-4">
          <List.Icon name="comments" />
          <List.Content>
            <List.Description
              style={{
                "line-height": "normal",
              }}
            >
              การลงทะเบียนใช้ PAKU และการลงประกาศที่จอดรถโดยไม่มีค่าใช้จ่าย
              เมื่อมีผู้จองที่จอดรถ เราจะเรียกเก็บค่าบริการประมาณ 3%
              จากเจ้าของที่จอดรถเพื่อช่วยค่าใช้จ่ายในการดำเนินธุรกิจของ PAKU
            </List.Description>
          </List.Content>
        </List.Item>

        <List.Item>
          <List.Icon name="help" />
          <List.Content>
            <List.Header>
              <div>ฉันจะเลือกราคาที่จอดรถอย่างไรดี</div>
            </List.Header>
          </List.Content>
        </List.Item>
        <List.Item className="mb-4">
          <List.Icon name="comments" />
          <List.Content>
            <List.Description
              style={{
                "line-height": "normal",
              }}
            >
              คุณสามารถตั้งราคาที่จอดรถได้ตามต้องการ เพื่อช่วยคุณตัดสินใจ
              ลองเปรียบเทียบราคาที่จอดรถในย่านเดียวกันเพื่อดูราคาตลาด
            </List.Description>
          </List.Content>
        </List.Item>

        <List.Item>
          <List.Icon name="help" />
          <List.Content>
            <List.Header>
              <div>PAKU จะช่วยฉันตั้งราคาได้อย่างไร</div>
            </List.Header>
          </List.Content>
        </List.Item>
        <List.Item className="mb-4">
          <List.Icon name="comments" />
          <List.Content>
            <List.Description
              style={{
                "line-height": "normal",
              }}
            >
              เครื่องมือตั้งราคาแบบชาญฉลาดของ PAKU
              ช่วยปรับราคาขึ้นลงโดยอัตโนมัติตามความต้องการที่จอดรถ
              ที่มีสิ่งอำนวยความสะดวกใกล้เคียงกัน ในย่านเดียวกัน
              แต่คุณยังเป็นผู้ควบคุมราคาเอง
            </List.Description>
          </List.Content>
        </List.Item>
      </List>
    );
  };

  showRentDetail = () => {
    return (
      <List as="ol">
        <List.Item>
          <List.Content>
            <List.Header>
              <div>วิธีการให้เช่าที่จอดรถ</div>
            </List.Header>
            <List.List as="ul" className="mt-3">
              <List.Item
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>เพิ่มตำแหน่งที่ตั้ง ที่คุณต้องการจะให้เช่า</div>
                  </List.Header>
                  <List.Description>
                    ระบุสถานที่ตั้งของที่จอดรถของคุณ คุณสามารถระบุตำแหน่งจาก GPS
                    หรือสามารถพิมพ์ที่อยู่ก็ได้
                  </List.Description>
                </List.Content>
              </List.Item>
              <List.Item
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>ใส่รายละเอียดของพื้นที่ที่ต้องการเปิดให้เช่า</div>
                  </List.Header>
                  <List.Description>
                    PAKU ของเราไม่มีนโยบายกำหนดราคาค่าเช่าขั้นต่ำ
                    คุณสามารถตั้งราคาค่าเช่าตามทีคุณเห็นสมควร
                    และไม่ต้องเป็นกังวล หากราคายังไม่เป็นที่พอใจ
                    ไม่ว่าจะเป็นรายชั่วโมง รายวัน รายอาทิตย์ รายเดือน
                    คุณสามารถกำหนดเองได้ และหากคุณต้องการเปลี่ยนแปลงราคา
                    คุณสามารถกลับมาแก้ไขใหม่ได้ หรือถ้าหากคุณยังตัดสินใจไม่ได้
                    PAKU มี เครื่องมือตั้งราคาแบบชาญฉลาด
                    ช่วยปรับราคาขึ้นลงโดยอัตโนมัติตามความต้องการที่จอดรถ
                    ที่มีสิ่งอำนวยความสะดวกใกล้เคียงกัน ในย่านเดียวกัน
                    แต่คุณยังเป็นผู้ควบคุมราคาเอง
                  </List.Description>
                </List.Content>
              </List.Item>
              <List.Item
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>ตั้งราคาที่คุณพอใจ</div>
                  </List.Header>
                  <List.Description>
                    รายละเอียดของสิ่งอำนวยความสะดวก เช่น
                    พื้นที่ที่คุณต้องการเปิดให้เช่ามีสิ่งอำนวยความสะดวกอะไรบ้าง
                    (มีหลังคา, มีกล้องวงจรปิด ฯ) รายละเอียดเกี่ยวกับที่ตั้ง เช่น
                    อยู่ใกล้กับสถานที่ใดบ้าง
                    ข้อมูลส่วนนี้จะช่วยตัดสินใจให้ผู้ที่ต้องการมาเช่าใช้บริการของคุณ
                    และหากคุณต้องการแก้ไข คุณสามารถกลับมาแก้ไขใหม่ได้
                  </List.Description>
                </List.Content>
              </List.Item>
              <List.Item
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>ตรวจสอบรายละเอียด แล้วกดยืนยัน</div>
                  </List.Header>
                </List.Content>
              </List.Item>
            </List.List>
          </List.Content>
        </List.Item>

        <List.Item className="mt-4">
          <List.Content>
            <List.Header>
              <div>ให้เช่าที่จอดรถยามต้องการ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              ไม่ต้องเป็นกังวลในวันที่คุณมีธุระ เรามีตัวเลือก การบล็อควัน
              เพียงแค่คุณเลือกวันที่คุณต้องการจะปิดชั่วคราว ระบบจะทำการผู้ใช้
              จองวันเหล่านั้นได้
            </List.Description>
          </List.Content>
        </List.Item>

        <List.Item className="mt-4">
          <List.Content>
            <List.Header>
              <div>การให้เรตติ้งผู้ใช้บริการพื้นที่ของเรา</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              ไม่เฉพาะผู้มาใช้บริการที่สามารถให้เรตติ้งเราได้เรายังสามารถให้เรตติ้งกับผู้ใช้บริการพื้นที่เรา
              ได้เช่นกัน ทั้งนี้ทั้งนั้นต้องประเมินตามความเป็นจริง
            </List.Description>
          </List.Content>
        </List.Item>
      </List>
    );
  };

  showTermsDetail = () => {
    return (
      <List as="ol">
        <List.Item>
          <List.Content>
            <List.Header>
              <div>ให้เช่าที่จอดรถยามต้องการ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;สวัสดีและยินดีต้อนรับสู่
              ข้อกำหนดและเงื่อนไขการใช้บริการของ PAKU (“ข้อกำหนด”)
              โปรดอ่านข้อกำหนด นโยบายความเป็นส่วนตัว และเงื่อนไขการใช้งาน
              โดยละเอียดเพื่อประโยชน์ในการรับบริการจากเรา
              <br />
              <br />
              &nbsp;&nbsp;การตกลงสมัครเข้าใช้บริการ
              ถือว่าผู้ใช้บริการยอมรับว่าได้อ่านและทำความเข้าใจเงื่อนไขการใช้บริการและนโยบายความเป็นส่วนตัวโดยละเอียดถี่ถ้วนแล้ว
              และผู้ใช้บริการ (“คุณ”)
              ยอมรับเงื่อนไขการใช้บริการทุกประการและนโยบายความเป็นส่วนตัว
              เงื่อนไขการใช้บริการฉบับนี้มีผลผูกพันผู้ใช้บริการตามกฎหมาย
            </List.Description>
            <List.List className="mt-3">
              <List.Item
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>บทนำ</div>
                  </List.Header>
                  <List.Description>
                    &nbsp;&nbsp;ขอขอบคุณที่เลือกใช้ PAKU (“PAKU”,
                    “ผู้ให้บริการ”, “เรา”, “พวกเรา”, “ของเรา”) PAKU
                    ให้บริการจองที่จอดรถสำหรับผู้ต้องการจองที่จอดรถและให้บริการสำหรับผู้ต้องการให้เช่าพื้นที่จอดรถสำหรับผู้ที่มีพื้นที่ปล่อยให้เช่าเป็นที่จอดรถ
                    (เรียกรวมว่า “ผู้ใช้บริการ”) รวมถึงผลิตภัณฑ์และการบริการอื่น
                    ๆ ที่อาจมีการพัฒนาเป็นครั้งคราว ในการตกลงสมัครเข้าใช้บริการ
                    หรืออีกนัยหนึ่งคือ การใช้บริการใด ๆ เหล่านี้ของ PAKU
                    รวมถึงคุณลักษณะและฟังก์ชันการทำงาน
                    เว็บไซต์และอินเทอร์เฟซผู้ใช้
                    เช่นเดียวกันกับเนื้อหาและแอปพลิเคชันซอฟต์แวร์ทั้งหมดที่สัมพันธ์กับการบริการของเรา
                    (เรียกรวมว่า “การบริการของ PAKU”หรือ “การบริการ”)
                    คุณกำลังทำสัญญาซึ่งมีผลผูกพันผู้ใช้บริการตามกฎหมาย
                    <br />
                    <br />
                    &nbsp;&nbsp;การใช้บริการของเรานั้น
                    ผู้ใช้บริการต้องเข้าใจและยอมรับข้อตกลง เงื่อนไขการใช้บริการ
                    และนโยบายความเป็นส่วนตัวต่าง ๆ ของเราทั้งหมดก่อน
                    <br />
                    <br />
                    &nbsp;&nbsp;การสมัครเข้าใช้บริการ การยอมรับข้อตกลง
                    เงื่อนไขการใช้บริการ และนโยบายความเป็นส่วนตัวต่าง ๆ
                    ถือว่าผู้ใช้บริการยอมรับได้ว่า
                    อ่านและเข้าใจพร้อมทั้งตกลงยินยอมตามข้อตกลง
                    เงื่อนไขการใช้บริการ
                    นโยบายความเป็นส่วนตัวและหรือข้อบังคับอื่นใดแล้วแต่กรณี
                    <br />
                    <br />
                    &nbsp;&nbsp;ในการใช้บริการของ PAKU คุณต้อง
                    <br />
                    &nbsp;&nbsp;1.1 มีอายุถึงตามข้อกำหนดด้านอายุดังนี้
                    <br />
                    &nbsp;&nbsp;&nbsp;&nbsp;1.1.1
                    ในส่วนของผู้จองที่จอดรถต้องมีอายุตั้งแต่ 18 ปีขึ้นไป
                    <br />
                    &nbsp;&nbsp;&nbsp;&nbsp;1.1.2
                    ในส่วนของผู้ให้เช่าพื้นที่จอดรถต้องมีอายุตั้งแต่ 20 ปีขึ้นไป
                    <br />
                    &nbsp;&nbsp;1.2 พักอาศัยภายในราชอาณาจักรไทย
                    และคุณยังให้สัญญาว่า ข้อมูลที่ได้ลงทะเบียนไว้กับ PAKU
                    เป็นความจริง ถูกต้อง และครบถ้วน
                    คุณยอมรับที่จะรักษาข้อมูลให้เป็นเช่นนั้นตลอดเวลาอีกด้วย
                    และเพื่อประโยชน์ในการให้บริการในบางกรณีผู้ให้บริการ
                    อาจร้องขอเอกสารเพิ่มเติมเพื่อยืนยันข้อมูลต่าง ๆ
                    และผู้ใช้บริการยอมรับที่ต้องปฏิบัติตามคำร้องขอ
                  </List.Description>
                </List.Content>
              </List.Item>
              <List.Item
                className="mt-3"
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>การเปลี่ยนแปลงข้อตกลง</div>
                  </List.Header>
                  <List.Description>
                    &nbsp;&nbsp;ผู้ให้บริการอาจทำการเปลี่ยนแปลงข้อตกลงตามเหตุอันสมควรเป็นครั้งคราว
                    หรือเพิ่มฟังก์ชันหรือคุณลักษณะ
                    และการปรับตั้งค่าทางเทคนิคอันมีเหตุสมควรแก่การให้บริการ
                    ตรวจสอบการทำงาน หรือความปลอดภัยของการให้บริการ
                    และด้วยเหตุผลทางกฎหมายหรือข้อบังคับ
                    เมื่อเราทำการเปลี่ยนแปลงเนื้อหาในข้อตกลง
                    เราจะทำการแจ้งให้คุณทราบตามความเหมาะสมของสถานการณ์
                    ยกตัวอย่างเช่น แจ้งโดยการแสดงข้อความที่มองเห็นได้ชัดเจน
                    หรือแจ้งโดยการส่งอีเมล
                    <br />
                    <br />
                    &nbsp;&nbsp;ผู้ใช้บริการต้องเข้าใจและยอมรับข้อตกลงและเงื่อนไขต่าง
                    ๆ ของผู้ให้บริการที่ได้มีการเปลี่ยนแปลงแล้ว
                    หากผู้ใช้บริการเข้าใช้บริการหลังมีการเปลี่ยนแปลง
                  </List.Description>
                </List.Content>
              </List.Item>
              <List.Item
                className="mt-3"
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>การรักษาข้อมูลส่วนบุคคล</div>
                  </List.Header>
                  <List.Description>
                    &nbsp;&nbsp;ข้อมูลส่วนบุคคลของผู้ใช้บริการ
                    จะไม่เปิดเผยความลับหรือข้อมูลส่วนบุคคลของท่านให้แก่บุคคลภายนอกหรือองค์กรอื่นใดไม่ว่าเพื่อวัตถุประสงค์ใด
                    ๆ เว้นแต่
                    <br />
                    &nbsp;&nbsp;3.1 ได้รับความยินยอมจากผู้ใช้บริการ
                    <br />
                    &nbsp;&nbsp;&nbsp;&nbsp;3.1.1
                    ในส่วนของผู้ใช้บริการจะมมีการแสดงข้อมูลบางส่วน เช่น เบอร์โทร
                    ชื่อ เป็นต้น เพื่อใช้ในการติดต่อ
                    <br />
                    &nbsp;&nbsp;3.2 กระทำการตามที่กฎหมายบังคับ
                    และหรือตามคำสั่งหรือหมายของศาล เป็นต้น
                    <br />
                    &nbsp;&nbsp;3.3 เป็นไปตาม นโยบายความเป็นส่วนตัว
                    <br />
                    &nbsp;&nbsp;3.4
                    ในส่วนของผู้ให้เช่าพื้นที่จอดรถจำเป็นต้องมีการเปิดเผยข้อมูลบางส่วน
                    เช่น เบอร์ติดต่อ เป็นต้น
                    เพื่อให้ผู้จองที่จอดรถสามารถติดต่อได้สะดวกมากยิ่งขึ้น
                  </List.Description>
                </List.Content>
              </List.Item>
              <List.Item
                className="mt-3"
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>ลิขสิทธิ์ของผู้ให้บริการ</div>
                  </List.Header>
                  <List.Description>
                    &nbsp;&nbsp;ผู้ให้บริการ มีซึ่งสิทธิ ลิขสิทธิ์
                    และทรัพย์สินทางปัญญาในข้อมูลที่แสดง รูปภาพ และ
                    รูปแบบการแสดงผล ตามที่ปรากฏในเว็บไซต์ทั้งหมด
                    ยกเว้นจะมีการระบุอย่างชัดเจนเป็นอื่น
                    ห้ามมิให้ผู้ใดทำการคัดลอก ทำซ้ำ มีสำเนา สำรองไว้ ทำเลียนแบบ
                    ทำเหมือน ดัดแปลง ทำเพิ่ม
                    เพื่อนำไปเผยแพร่ด้วยวัตถุประสงค์อื่นใด
                    โดยปราศจากความยินยอมเป็นหนังสือจากผู้ให้บริการ
                    ทั้งนี้เว้นแต่จะได้มีการระบุกำหนดไว้ในข้อตกลง
                    เงื่อนไขการใช้บริการ และนโยบายความเป็นส่วนตัว ๆ เว้นแต่
                  </List.Description>
                </List.Content>
              </List.Item>
              <List.Item
                className="mt-3"
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>สิทธิของผู้ให้บริการ</div>
                  </List.Header>
                  <List.Description>
                    &nbsp;&nbsp;ผู้ให้บริการ สามารถนำข้อมูลใด ๆ
                    ก็ตามที่ผู้ใช้บริการให้กับผู้ให้บริการ โดยผ่าน PAKU
                    ไปใช้ในการวิจัย วิเคราะห์ แยกแยะ และหรืออื่นใด
                    ตามที่เห็นสมควร โดยมิต้องแจ้งให้ทราบล่วงหน้า
                    ต้องเป็นข้อมูลที่ผู้ใช้บริการยินยอมให้ใช้ตามข้อตกลง
                    เงื่อนไขการใช้บริการ และนโยบายความเป็นส่วนตัว
                  </List.Description>
                </List.Content>
              </List.Item>
              <List.Item
                className="mt-3"
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>การระงับการให้บริการ</div>
                  </List.Header>
                  <List.Description>
                    &nbsp;&nbsp;ผู้ให้บริการ
                    สามารถระงับการใช้บริการแก่ผู้ใช้บริการใด ๆ ตามเห็นสมควรได้
                    ถึงแม้ว่าผู้ใช้บริการจะไม่ได้ละเมิดข้อตกลง
                    เงื่อนไขการใช้การบริการ และนโยบายความเป็นส่วนตัวใด ๆ ก็ตาม
                    และผู้ใช้บริการไม่สามารถเรียกร้องค่าเสียหายอื่น ๆ
                    จากผู้ให้บริการได้
                    <br />
                    &nbsp;&nbsp;ผู้ให้บริการ อาจระงับการให้บริการเป็นการชั่วคราว
                    ด้วยเหตุจำเป็นบางประการ และถือว่า
                    ผู้ให้บริการไม่มีความรับผิดในการระงับบริการดังกล่าวไม่ว่าประการใด
                    ซึ่งรวมถึงข้อบกพร่องที่ไม่สามารถคาดการณ์ได้ล่วงหน้า
                    อันอาจจะเกิดจุดบกพร่องของอุปกรณ์ ซอฟต์แวร์
                    หรือสิ่งอื่นใดที่มีผลกระทบต่อการใช้บริการและให้บริการ
                  </List.Description>
                </List.Content>
              </List.Item>
              <List.Item
                className="mt-3"
                as="li"
                style={{
                  "line-height": "normal",
                }}
              >
                <List.Content>
                  <List.Header>
                    <div>ข้อกำหนดของพวกเรา</div>
                  </List.Header>
                  <List.Description>
                    &nbsp;&nbsp;ผู้ให้บริการ ขอแจ้งให้ทราบและเข้าใจ ดังนี้
                    <br />
                    &nbsp;&nbsp;7.1
                    ผู้ให้บริการไม่รับผิดชอบต่อความเสียหายใดๆก็ตามที่เกิดจากการใช้บริการ
                    หรือเกิดจากความบกพร่องของผู้ใช้บริการ
                    <br />
                    &nbsp;&nbsp;7.2
                    หากความเสียหายใดๆก็ตามที่ผู้ใช้บริการกระทำการ
                    หรือจงใจกระทำการ หรือพยายามกระทำการไม่ว่าจะทางตรงหรือทางอ้อม
                    อันจะทำให้ผู้ใช้บริการท่านอื่นหรือบุคคลอื่นใดก็ตามได้รับความเสียหาย
                    เสียชื่อเสียง หรือสิ่งใด ให้ผู้ใช้บริการท่านนั้น ๆ
                    เป็นผู้รับผิดชอบแต่เพียงผู้เดียว
                    ผู้ให้บริการจะไม่มีส่วนรับผิดชอบใด ๆ ทั้งสิ้น
                    <br />
                    &nbsp;&nbsp;7.3
                    หากความเสียหายใดๆก็ตามที่ผู้ใช้บริการกระทำการ
                    หรือจงใจกระทำการ หรือพยายามกระทำการไม่ว่าจะทางตรงหรือทางอ้อม
                    อันจะทำให้ผู้ให้บริการได้รับความเสียหาย เสียชื่อเสียง
                    หรือสิ่งใด ผู้ให้บริการมีสิทธิเรียกร้องค่าเสียหาย
                    หรือฟ้องร้องดำเนินคดีตามกฎหมายได้
                    <br />
                    &nbsp;&nbsp;7.4 ข้อกำหนด ข้อตกลง สัญญา
                    หรือข้อความใดในเงื่อนไขการใช้บริการนี้
                    หากเป็นโมฆะหรือโมฆียะให้เป็นไปตามกฎหมายของไทยเท่านั้น
                    ทั้งนี้ให้ยกเว้นส่วนที่ไม่ได้เป็นโมฆะหรือโมฆียะให้ใช้บังคับต่อไป
                    <br />
                    &nbsp;&nbsp;7.5 กรณีที่ข้อความใด ๆ มีความขัดหรือแย้งกัน
                    ในฉบับภาษาไทยและฉบับแปลภาษาอื่นๆ
                    ให้ถือตามฉบับภาษาไทยมีผลเหนือฉบับแปลภาษาอื่น ๆ
                    <br />
                    &nbsp;&nbsp;7.6
                    การกระทำใดๆก็ตามที่มีผลต่อการใช้บริการของผู้ให้บริการและผู้ใช้บริการ
                    ให้อยู่ภายใต้การบังคับของกฎหมายไทยเท่านั้น
                    โดยไม่คำนึงถึงสถานที่ตั้งของระบบ ข้อมูล และการใช้งาน
                    รวมถึงกฎหรือบทบัญญัติว่าด้วยการเลือกกฎหมายหรือการขัดกันของกฎหมาย
                    และให้ศาลในราชอาณาจักรไทยเป็นศาลที่มีเขตอำนาจในการพิจารณาชี้ขาดตัดสินข้อพิพาทที่เกิดขึ้นภายใต้
                    ข้อตกลง เงื่อนไขการใช้บริการ และนโยบายความเป็นส่วนตัว
                  </List.Description>
                </List.Content>
              </List.Item>
            </List.List>
          </List.Content>
        </List.Item>
      </List>
    );
  };

  showPrivacyDetail = () => {
    return (
      <List as="ol">
        <List.Item>
          <List.Content>
            <List.Header>
              <div>นโยบายคุ้มครองความเป็นส่วนตัว</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;การคุ้มครองความเป็นส่วนตัวและข้อมูลส่วนบุคคลบนเว็บไซต์
              PAKU ซึ่งในที่นี่จะเรียกว่า เว็บไซต์ PAKU
              <br />
              <br />
              &nbsp;&nbsp;PAKU
              ให้ความสำคัญในการคุ้มครองความเป็นส่วนตัวและข้อมูลส่วนบุคคลอย่างยิ่ง
              จึงจัดทำ นโยบายคุ้มครองความเป็นส่วนตัว (“นโยบายความเป็นส่วนตัว”,
              “นโยบาย”) เพื่อเป็นแนวทางปฏิบัติในการจัดการข้อมูลส่วนบุคคล
              (Personal Information) ของผู้ใช้บริการ ที่ติดต่อเข้ามายังเว็บไซต์
              PAKU ดังนั้น
              <br />
              <br />
              &nbsp;&nbsp;ทั้งนี้ การติดต่อเข้ามายังเว็บไซต์หรือเข้าใช้บริการของ
              PAKU ไม่ว่าจะด้วยวิธีการใด ให้
              ถือว่าท่านยินยอมผูกพันตามนโยบายฉบับนี้ทุกประการ
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>นโยบายนี้มีจุดมุ่งหมายเพื่อ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;1
              ให้มั่นใจว่าคุณเข้าใจว่าข้อมูลส่วนตัวใดบ้างเกี่ยวกับคุณที่เราเก็บรวบรวม
              เหตุผลที่เราเก็บรวบรวมและใช้ข้อมูลนั้น
              <br />
              &nbsp;&nbsp;2
              อธิบายวิธีที่เราใช้ข้อมูลส่วนตัวที่คุณแชร์กับเราเพื่อให้คุณได้รับประสบการณ์ที่ดีเยี่ยมเมื่อคุณใช้บริการของเรา
              <br />
              &nbsp;&nbsp;3
              อธิบายสิทธิ์และตัวเลือกที่คุณมีเกี่ยวกับข้อมูลส่วนตัวที่เราเก็บรวบรวมและประมวลผลเกี่ยวกับคุณและวิธีที่เราจะปกป้องความเป็นส่วนตัวของคุณ
              <br />
              เราหวังว่านโยบายนี้จะช่วยให้คุณเข้าใจความมุ่งมั่นของเราที่มีต่อความเป็นส่วนตัวของคุณ
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การเก็บข้อมูลส่วนบุคคล</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;1 ในการใช้งานเว็บไซต์ PAKU ต้องมีการสมัคร (Sign Up)
              เพื่อใช้งานในส่วนผู้จองและหรือผู้ให้เช่าพื้นที่จอดรถ
              หรือเพื่อใช้บริการอย่างใดอย่างหนึ่ง ทางเว็บไซต์ PAKU
              มีความจำเป็นต้องจัดเก็บรวบรวมข้อมูลส่วนบุคคล เช่น อีเมลแอดเดรส
              (Email Address) ชื่อ (Name) ที่อยู่ (Address) เขตไปรษณีย์ (ZIP
              Code) หรือหมายเลขโทรศัพท์ (Telephone Number) เป็นต้น
              <br />
              &nbsp;&nbsp;2 นอกจากนั้นเพื่อสำรวจความนิยมในการใช้บริการ
              อันจะเป็นประโยชน์ในการนำสถิติไปใช้ในการปรับปรุงคุณภาพในการให้บริการของ
              เว็บไซต์ PAKU
              จึงจำเป็นต้องจัดเก็บรวบรวมข้อมูลของท่านบางอย่างเพิ่มเติมได้แก่
              หมายเลขไอพี (IP Address) ชนิดของโปรแกรมค้นผ่าน (Browser Type)
              โดเมนเนม (Domain Name) ตำแหน่งที่ตั้ง (Location) บันทึกหน้าเว็บ
              (web page) ของเว็บไซต์ที่ผู้ใช้เยี่ยมชม เวลาที่เยี่ยมชมเว็บไซต์
              (Access Times) และเว็บไซต์ที่ผู้ใช้บริการเข้าถึงก่อนหน้านั้น
              (Referring Website Addresses)
              <br />
              <br />
              &nbsp;&nbsp;เว็บไซต์ PAKU
              ขอแนะนำให้ท่านตรวจสอบนโยบายการคุ้มครองข้อมูลส่วนบุคคล (Privacy
              Policy) ของเว็บไซต์อื่นที่เชื่อมโยงจากเว็บไซต์นี้
              เพื่อจะได้ทราบและเข้าใจว่าเว็บไซต์ดังกล่าว เก็บ รวบรวมใช้
              หรือดำเนินการเกี่ยวกับข้อมูลส่วนบุคคลของท่านอย่างไร ทั้งนี้
              เว็บไซต์ PAKU ไม่สามารถรับรองข้อความ หรือรับรองการดำเนินการใด ๆ
              ตามที่ได้มีการ ประกาศไว้ในเว็บไซต์ดังกล่าวได้ และไม่ขอรับผิดชอบใด
              ๆ หากเว็บไซต์เหล่านั้นไม่ได้ปฏิบัติการ หรือดำเนินการใด ๆ
              ตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลที่เว็บไซต์ดังกล่าวได้ประกาศไว้
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การใช้ข้อมูลส่วนบุคคล</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;1 เว็บไซต์ PAKU
              จะใช้ข้อมูลส่วนบุคคลของท่านเพียงเท่าที่จำเป็น เช่น ชื่อและที่อยู่
              เพื่อใช้ในการติดต่อให้บริการ ประชาสัมพันธ์
              หรือให้ข้อมูลข่าวสารต่าง ๆ
              รวมทั้งสำรวจความคิดเห็นของท่านในกิจการเท่านั้น
              <br />
              &nbsp;&nbsp;2 เว็บไซต์ PAKU ขอแจ้งให้ทราบว่า ข้อมูลต่าง ๆ
              ที่ผู้ใช้บริการ หรือผู้เข้าสู่ระบบ หรือผู้ทำรายการ
              ไม่ว่าจะด้วยวิธีการก็ตาม ได้นำข้อมูลเข้าสู่ระบบทางคอมพิวเตอร์
              จะมีสิทธิ์ในการใช้ข้อมูลต่างๆเหล่านั้นแต่เพียงผู้เดียว
              <br />
              &nbsp;&nbsp;3 ทั้งนี้
              การใช้งานข้อมูลส่วนบุคคลของท่านให้เป็นไปตามเงื่อนไขการใช้บริการ
              และนโยบายคุ้มครองความเป็นส่วนตัวนี้
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>สิทธิในการควบคุมข้อมูลส่วนบุคคลและความต้องการของท่าน</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;เพื่อประโยชน์ในการรักษาความเป็นส่วนตัวของท่าน
              ท่านมีสิทธิเลือกที่จะให้มีการใช้หรือแชร์ข้อมูลส่วนบุคคลของท่าน
              หรืออาจเลือกที่จะไม่รับข้อมูล หรือสื่อทางการตลาดใด ๆ จาก เว็บไซต์
              PAKU ก็ได้ นโยบายคุ้มครองความเป็นส่วนตัว ก็ได้
              โดยเพียงแต่ท่านกรอกความจำนงดังกล่าวเพื่อแจ้งให้ เว็บไซต์ PAKU ทราบ
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การรักษาความปลอดภัยสำหรับข้อมูลส่วนบุคคล</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;เนื่องจากเว็บไซต์ PAKU มีการยืนยันตัวตนด้วยบัตรประชาชน
              เนื่องจากเพื่อประโยชน์ในการรักษาความลับและความปลอดภัยสำหรับข้อมูลส่วนบุคคลของท่าน
              เว็บไซต์ PAKU
              จึงได้กำหนดระเบียบภายในหน่วยงานเพื่อกำหนดสิทธิในการเข้าถึง
              หรือใช้ข้อมูลส่วนบุคคลของท่าน และเพื่อรักษาความลับ
              และความปลอดภัยของข้อมูลบางอย่าง ที่มีความสำคัญอย่างยิ่ง เช่น
              หมายเลขบัตรเครดิต เป็นต้น เว็บไซต์ PAKU
              จึงได้จัดให้มีช่องทางการสื่อสารแบบปลอดภัย
              สำหรับข้อมูลดังกล่าวด้วยการเข้ารหัสลับข้อมูลดังกล่าว เช่น
              จัดให้มีการใช้ Secure Socket Layer (SSL) protocol เป็นต้น
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การปรับปรุงนโยบายการคุ้มครองข้อมูลส่วนบุคคล</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;เว็บไซต์ PAKU
              อาจทำการปรับปรุงหรือแก้ไขนโยบายการคุ้มครองข้อมูลส่วนบุคคลโดยมิได้แจ้งให้ท่านทราบล่วงหน้า
              ทั้งนี้เพื่อความเหมาะสมและมีประสิทธิภาพในการให้บริการ ดังนั้น
              เว็บไซต์ PAKU
              จึงขอแนะนำให้ผู้ใช้บริการอ่านนโยบายการคุ้มครองข้อมูลส่วนบุคคลทุกครั้งที่เยี่ยมชมหรือมีการใช้บริการจากเว็บไซต์ของ
              เว็บไซต์ PAKU
              <br />
              &nbsp;&nbsp;ในกรณีที่ท่านมีข้อสงสัย ข้อเสนอแนะ หรือข้อติชมใด ๆ
              เกี่ยวกับนโยบายการคุ้มครองข้อมูลส่วนบุคคล
              หรือการปฏิบัติตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ เว็บไซต์
              PAKU ยินดีที่จะตอบข้อสงสัยรับฟังข้อเสนอแนะ
              และคำติชมทั้งหลายอันจะเป็นประโยชน์ต่อการปรับปรุงการให้บริการของ
              เว็บไซต์ PAKU ต่อไป โดยท่านสามารถติดต่อกับ เว็บไซต์ PAKU
              ตามที่อยู่ที่ปรากฏบนเว็บไซต์
            </List.Description>
          </List.Content>
        </List.Item>
      </List>
    );
  };

  showSecurityDetail = () => {
    return (
      <List as="ol">
        <List.Item>
          <List.Content>
            <List.Header as="h4" className="mb-2">
              <div>การยืนยันตัวตน</div>
            </List.Header>
            <List.Header>
              <div>การตรวจสอบโปรไฟล์ผู้เช่าที่จอดรถ และเจ้าของที่จอดรถ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ทุกครั้งที่มีการสร้างบัญชีใหม่
              เราจะมีการตรวจสอบว่ามีตัวตนจริงๆ และใช้ชื่อ นามสกุล อายุจริง
              โดยการยืนยันตัวตนโดยใช้บัตรประชาชน
              ผู้ใช้สามารถวางใจได้ว่าทุกๆคนที่ใช้ PAKU มีตัวตนจริงๆ
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การชำระเงินที่ปลอดภัย</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;เราชำระด้วยเงินสด
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การคุ้มครองบัญชีผู้ใช้</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;เราใช้มาตรการหลายอย่างเพื่อปกป้อง บัญชีผู้ใช้ PAKU
              ของคุณ เช่น ต้องการตรวจสอบความแท้จริงแบบหลายชั้น
              เมื่อคุณพยายามเข้าสู่ระบบจากโทรศัพท์หรือคอมพิวเตอร์เครื่องใหม่และเราส่งการแจ้งเตือนเข้าบัญชีผู้ใช้เมื่อมีการเปลี่ยนแปลง
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การป้องกันการหลอกลวง</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;จ่ายเงินและสื่อสารโดยตรงผ่านทางเว็บไซต์ PAKU เสมอ
              ตราบเท่าที่คุณอยู่ใน PAKU ตลอดทั้งกระบวนการตั้งแต่การสื่อสาร
              การจอง การชำระเงิน
              คุณจะได้รับการปกป้องโดยกลยุทธ์การป้องกันหลายชั้นของเรา
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การป้องกันผู้ใช้ที่ไม่โปร่งใส</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณสามารถร้องเรียนเกี่ยวกับผู้ใช้ได้ตลอด
              เมื่อเราทำการตรวจสอบบัญชีใช้นั้นๆ และพบความผิดปกติบางอย่าง
              เราจะทำการแบน และลบบัญชีผู้ใช้ทิ้ง คุณสามารถวางใจได้ว่า
              จะไม่พบกับบัญชีของผู้ที่ไม่โปร่งใสอีก
            </List.Description>
          </List.Content>
        </List.Item>

        <Divider />

        <List.Item className="mt-3">
          <List.Content>
            <List.Header as="h4" className="mb-2">
              <div>รู้ถึงสิ่งที่คาดหวัง</div>
            </List.Header>
            <List.Header>
              <div>โปรไฟล์</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ผู้เช่าที่จอดรถหรือเจ้าของที่จอดรถใน PAKU
              มีโปรไฟล์ที่จะยืนยันตัวบุคคลว่ามีตัวตนจริงๆ
              โดยได้ผ่านการตรวจสอบจากทาง PAKU เป็นที่เรียบร้อยแล้ว
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การส่งข้อความที่ปลอดภัย</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;การส่งข้อความที่ปลอดภัยของเราช่วยให้คุณรู้จักผู้เช่าที่จอดรถหรือเจ้าของที่จอดรถ
              และสามารถถามคำถามเกี่ยวกับที่จอดรถหรือสิ่งที่ผู้เช่าต้องการทราบจากเจ้าของที่จอดรถ
              คุณสามารถใช้เพื่อส่งข้อความกลับไปมาได้อย่างง่ายดาย
              ตามที่อยู่ที่ปรากฏบนเว็บไซต์
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>รีวิว</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;หากคุณอยากรู้เกี่ยวกับสิ่งที่คนอื่นคิด
              เกี่ยวกับบุคคลที่มีโอกาสเป็นผู้เช่าที่จอดรถหรือเจ้าของที่จอดรถ
              คุณแค่ดูรีวิวของเขา เกี่ยวกับประสบการณ์หลังการใช้บริการของที่นั่นๆ
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>ความปลอดภัยของคุณเป็นสิ่งสำคัญของเรา</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ประสบการณ์ PAKU
              ของคุณเริ่มเมื่อคุณใช้ปลายนิ้วของคุณแตะปุ่มจอง
              ซึ่งเป็นไปได้เมื่อคุณไว้ใจชุมชนนี้และรู้สึกปลอดภัย
              ดังนั้นความปลอดภัยจึงเป็นสิ่งที่เราให้ความสำคัญสูงสุด
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>ความปลอดภัยของคุณเป็นสิ่งสำคัญของเรา</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ประสบการณ์ PAKU
              ของคุณเริ่มเมื่อคุณใช้ปลายนิ้วของคุณแตะปุ่มจอง
              ซึ่งเป็นไปได้เมื่อคุณไว้ใจชุมชนนี้และรู้สึกปลอดภัย
              ดังนั้นความปลอดภัยจึงเป็นสิ่งที่เราให้ความสำคัญสูงสุด
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การทำร้ายตัวเองหรือคนอื่น ๆ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณไม่ควรกระทำการล่วงเกินทางเพศหรือความรุนแรงทางเพศ
              ความรุนแรงในครอบครัว การโจรกรรม การค้ามนุษย์ การกระทำรุนแรงอื่น ๆ
              หรือการถือครองบุคคลใด ๆ ที่ขัดต่อเจตจำนง
              สมาชิกในองค์กรที่เป็นอันตรายรวมถึงกลุ่มผู้ก่อการร้าย
              กลุ่มอาชญากรรมที่มีความผิดทางอาญาและกลุ่มที่มีความรุนแรงจะไม่ได้รับการต้อนรับในชุมชนนี้
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การข่มขู่</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ห้ามแสดงเจตนาในการทำร้ายผู้อื่นด้วยคำพูดหรือการกระทำ
              เราถือว่าการข่มขู่ทำร้ายร่างกาย เป็นเรื่องร้ายแรง
              และทางเราจะเข้าไปตรวจสอบและช่วยเหลือ เมื่อพบการกระทำเหล่านี้
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การสร้างสถานการณ์ที่เป็นอันตราย</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณไม่ควรเก็บอาวุธที่ไม่มีการรักษาความปลอดภัย
              และไม่ควรสร้างสภาพที่เพิ่มแนวโน้มการเกิดไฟไหม้หรือขัดขวางทางหลบหนีในกรณีฉุกเฉิน
            </List.Description>
          </List.Content>
        </List.Item>

        <Divider />

        <List.Item className="mt-3">
          <List.Content>
            <List.Header as="h4" className="mb-2">
              <div>ความเป็นธรรม</div>
            </List.Header>
            <List.Header>
              <div>พฤติกรรมคัดค้านสิทธิ์หรือคำพูดแสดงความเกลียดชัง</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณควรปฏิบัติต่อทุกคนด้วยความเคารพ
              ดังนั้นคุณควรปฏิบัติตามกฎหมายที่บังคับใช้ทั้งหมดและไม่ปฏิบัติต่อผู้อื่นเนื่องจากเชื้อชาติ
              ชาติกำเนิด ความผูกพันทางศาสนา รสนิยมทางเพศ เพศ อัตลักษณ์ทางเพศ
              ความพิการหรือโรคร้ายแรง
              ในทำนองเดียวกันการดูถูกคนอื่นในฐานเหล่านี้ก็ไม่ได้รับอนุญาต
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การระรานหรือคุกคามผู้อื่น</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณไม่ควรแชร์ข้อมูลส่วนตัวเพื่อประนามหรือแบล็คเมล์ผู้อื่น
              ไม่กระทำพฤติกรรมที่เป็นการโจมตีผู้อื่น
              ไม่ทำให้ผู้อื่นเสียชื่อเสียง
              หรือละเมิดมาตรฐานในการแสดงความเห็นและเขียนข้อความของเรา
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การรบกวนชุมชนในบริเวณโดยรอบ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณไม่ควรรบกวนพื้นที่ใช้ร่วมกัน
              หรือปฏิบัติกับเจ้าของที่เช่ารถเหมือนเป็น "พนักงานต้อนรับ"
              สร้างความรำคาญให้คนที่อยู่รอบตัวคุณ
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การให้ข้อมูลที่เป็นจริง</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ประสบการณ์ PAKU
              ของคุณควรจะเต็มไปด้วยช่วงเวลาที่มีความสุขและการความไว้ใจ
              ชุมชนของเรามีพื้นฐานอยู่บนความไว้ใจ
              ข้อมูลที่เป็นจริงจึงเป็นสิ่งสำคัญ
              เราอยากให้ประสบการ์ณที่ผู้เช่าที่จอดรถได้รับ
              เป็นไปตามที่คุณคาดหวัง พูดคุยกันอย่างจริงใจ
              ด้วยข้อมูลที่เป็นจริงเชื่อถือได้
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การปกปิดตัวตน</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ไม่ควรใช้ชื่อปลอมหรือใช้วันเกิดปลอม
              ใช้ที่จอดรถเพื่อวัตถุประสงค์เชิงพาณิชย์โดยไม่มีสิทธิจากเจ้าของที่พัก
              มี 2 บัญชี หรือสร้างบัญชีทั้งที่อายุต่ำกว่า 18 ปี
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การให้ข้อมูลที่จอดรถไม่ตรงกับความเป็นจริง</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ไม่ควรให้ข้อมูลที่จอดรถว่างที่ไม่ตรงกับความเป็นจริง
              ให้ข้อมูลที่จอดรถไม่ตรงกับความเป็นจริง
              ลงประกาศที่จอดรถหนึ่งแต่ให้เช่าไปอีกที่หนึ่ง ลงประกาศที่จอดรถปลอม
              ปลอมความคิดเห็น ตั้งราคาหลอก
              หรือไม่บอกถึงอันตรายหรือปัญหาของที่จอดรถ
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>ความน่าเชื่อถือ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ทุกๆ ประสบการณ์การ PAKU
              มีเอกลักษณ์และรายละเอียดที่แตกต่างกันไปสำหรับที่เช่าแต่ละที่
              ในแต่ละย่าน รวมถึงเจ้าของที่แต่ละคน
              เนื่องจากชุมชนของเรามีพื้นฐานอยู่บนสิ่งเหล่านี้
              ความน่าเชื่อถือจึงเป็นสิ่งสำคัญ
              ไม่ว่าจะเป็นการติดต่อสื่อสารกันอย่างเหมาะสม สภาพของที่จอดรถ
              หรือข้อมูลอื่นๆ ที่ได้มาตรฐานตามที่เราตั้งไว้
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การไม่ทำตามคำสัญญา</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;การไม่ทำตามกฎข้อบังคับข้อเรา และของเจ้าของที่จอดรถ
              หรือการจองที่จอดรถอันก่อให้ ผู้อื่นไม่สามารถจอดที่จอดรถได้
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>การไม่ตอบกลับ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;ไม่ควรปล่อยให้คะแนนในการตอบกลับผู้เช่าที่จอดรถต่ำเกินมาตรฐาน
              ไม่ควรปล่อยให้ผู้เช่ารอการตอบกลับนานเกินไป
              หรือไม่ตอบข้อความช่วงที่มีการจองที่จอดรถหรือช่วงที่เช่าที่จอดรถ
            </List.Description>
          </List.Content>
        </List.Item>
      </List>
    );
  };

  showFinanceDetail = () => {
    return (
      <List as="ol">
        <List.Item>
          <List.Content>
            <List.Header>
              <div>ชำระเงินได้ง่าย ๆ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณสามารถชำระเงินให้กับเจ้าของที่จอดรถได้โดยตรง
              และอาจมีการให้บริการผ่านทางอื่นในอนาคต
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>ลงประกาศที่จอดรถฟรี</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณสามารถโฆษณาที่จอดรถให้กับนักเดินทางโดยไม่มีข้อผูกมัดใด
              ๆ ไม่มีค่าลงทะเบียนหรือค่าสมาชิก
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>คำแนะนำการกำหนดราคาที่เชื่อถือได้</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณกำหนดราคาได้เอง หากต้องการความช่วยเหลือ
              เรามีเครื่องมือที่ช่วยปรับราคาให้เป็นไปตามอุปสงค์
              เพื่อคุณจะได้ราคาที่ดีในแต่ละคืน
            </List.Description>
          </List.Content>
        </List.Item>
        <List.Item className="mt-3">
          <List.Content>
            <List.Header>
              <div>ปรับให้ตรงความต้องการของคุณ</div>
            </List.Header>
            <List.Description
              className="mt-2"
              style={{
                "line-height": "normal",
              }}
            >
              &nbsp;&nbsp;คุณสามารถตั้งราคาสำหรับฤดูกาล ช่วงวันหยุดสุดสัปดาห์
              หรือคืนใดก็ได้ที่ต้องการควบคุมราคาเอง
              คุณสามารถเสนอส่วนลดรายสัปดาห์และรายเดือนให้กับคนที่มีแผนจะเช่าที่จอดรถนาน
            </List.Description>
          </List.Content>
        </List.Item>
      </List>
    );
  };

  render() {
    var rendererList;

    if (this.state.activeItem === "faq") {
      rendererList = this.showFaqDetail();
    }
    if (this.state.activeItem === "rent") {
      rendererList = this.showRentDetail();
    }
    if (this.state.activeItem === "terms") {
      rendererList = this.showTermsDetail();
    }
    if (this.state.activeItem === "privacy") {
      rendererList = this.showPrivacyDetail();
    }
    if (this.state.activeItem === "security") {
      rendererList = this.showSecurityDetail();
    }
    if (this.state.activeItem === "finance") {
      rendererList = this.showFinanceDetail();
    }

    return (
      <Responsive>
        <NavMenu />
        <Menu pointing secondary fluid>
          <Menu.Item
            content="คำถามที่พบบ่อย"
            name="faq"
            active={this.state.activeItem === "faq"}
            onClick={this.handleItemClick}
          />
          <Menu.Item
            content="การให้เช่า"
            name="rent"
            active={this.state.activeItem === "rent"}
            onClick={this.handleItemClick}
          />
          <Menu.Item
            content="ข้อกำหนดและเงื่อนไข"
            name="terms"
            active={this.state.activeItem === "terms"}
            onClick={this.handleItemClick}
          />
          <Menu.Item
            content="ความเป็นส่วนตัว"
            name="privacy"
            active={this.state.activeItem === "privacy"}
            onClick={this.handleItemClick}
          />
          <Menu.Item
            content="ความปลอดภัย"
            name="security"
            active={this.state.activeItem === "security"}
            onClick={this.handleItemClick}
          />
          <Menu.Item
            content="การเงิน"
            name="finance"
            active={this.state.activeItem === "finance"}
            onClick={this.handleItemClick}
          />
        </Menu>
        <Responsive
          className="mb-5"
          style={{
            "margin-top": "1.5rem",
          }}
        >
          <Container className="pt-3 pb-5" fluid textAlign="left">
            {rendererList}
          </Container>
        </Responsive>
        <Footer />
      </Responsive>
    );
  }
}

export default Support;